config/Catalogs/ПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диалог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/НаименованияЗонСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НаименованияЗонСклада</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/CommonModules/ОМ10_ВнешниеПечатныеФормы/Ext/Module.bsl
//============================================================================ GtG ===
Процедура ОМ10_ЗаполнитьСписокПечФорм  (Объект,СписокПечатныхФорм) Экспорт
	// Назначение:
	// Заполняет список печатных форм в форме объекта
	// Список должен быть реквизитом на форме, 
	// список значений с пометками
	//и называться СписокПечатныхФорм
	//--------------------------------------------------------------------------------
	//Документ объект: Поступление товара
	ТИПец=		  Строка(ТипЗнч(Объект));
	Типец=СтрЗаменить(Типец,"Документ объект: ","");
	//Сообщить(Типец);
	
	ТХТ= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПечатныеФормы.ПутьКФайлу,
	|	ПечатныеФормы.Объект,
	|	ПечатныеФормы.Наименование
	|ИЗ
	|	Справочник.ПечатныеФормы КАК ПечатныеФормы
	|ГДЕ
	|	ПечатныеФормы.Объект = &ИмяОбъекта
	|
	|СГРУППИРОВАТЬ ПО
	|	ПечатныеФормы.Наименование,
	|	ПечатныеФормы.ПутьКФайлу,  	
	|	ПечатныеФормы.Объект"  ;
	
	Запрос= Новый Запрос;
	Запрос.Текст=ТХТ;
	Запрос.УстановитьПараметр("ИмяОбъекта",Типец);
	Рез=Запрос.Выполнить();
	
	ТЗ=Рез.Выгрузить();
	
		
	Для каждого СТЗ Из ТЗ Цикл
		СписокПечатныхФорм.Добавить(СокрЛП(СТЗ.ПутьКФайлу),СТЗ.Наименование);
	КонецЦикла; 
		
 КонецПроцедуры//============================================================================ GtG ===


 // Виноходов ОВ
 Процедура ОМ10_КнопкаПечатьНажатие(Док,ФормаДок) Экспорт
	 	 Для Каждого ЭлементСписка Из ФормаДок.СписокПечатныхФорм Цикл 
		 Если ЭлементСписка.Пометка = Истина Тогда
			 
			 ПечФормы = Справочники.ПечатныеФормы.НайтиПоНаименованию(ЭлементСписка.Представление); 
			 ПоказатьДиалогПечати=ПечФормы.Диалог;
			   //ПоказатьДиалогПечати=ложь;
			 Попытка	
				 ВнешняяОбработка		= ВнешниеОбработки.Создать(ЭлементСписка.Значение);
			 Исключение	
				 Сообщить("Неудачный вызов обработки печати: "+ Строка(ЭлементСписка.Значение));
				 Возврат;	
			 КонецПопытки;
			 ВнешняяОбработка.Документ = Док.Ссылка;
			 ВнешняяОбработка.ПечататьСразу = не ПоказатьДиалогПечати;  // Просмотр печати без дополнительного диалога
			 Форма =ВнешняяОбработка.ПолучитьФорму("ДиалогПечати");
			 Форма.Открыть();
		 КонецЕсли;
	 КонецЦикла;
 КонецПроцедуры
 
 
 Функция ОМ10_ПолучитьИмяЗоны(КМХ="",Зона="",Склад="") Экспорт
	 
	 
	 
	 
	 ТХТ="ВЫБРАТЬ
	 |	НаименованияЗонСклада.Наименование
	 |ИЗ
	 |	Справочник.НаименованияЗонСклада КАК НаименованияЗонСклада
	 |ГДЕ
	 |	НаименованияЗонСклада.Склад.Ссылка = &Ссылка
	 |	И НаименованияЗонСклада.Зона =&Зона";
	 
	 Запрос=Новый Запрос;
	 Запрос.Текст=ТХТ;
	 Если КМХ<>"" тогда
		 Запрос.УстановитьПараметр("Ссылка",КМХ.Владелец.Ссылка);
		 Запрос.УстановитьПараметр("Зона",КМХ.Зона);
	 ИначеЕсли Зона<>"" тогда
		 Запрос.УстановитьПараметр("Ссылка",Склад.Ссылка);
		 Запрос.УстановитьПараметр("Зона",Зона);
	 Иначе
		 Возврат "";
	 КонецЕсли;
	 
	 
	 
	 
	 ТЗ=Запрос.Выполнить().Выгрузить();
	 
	 Если ТЗ.Количество()=0 тогда
		 Возврат "";
	 Иначе
		 Возврат ТЗ.Получить(0).Наименование;
	 КонецЕсли;	
 КонецФункции
